pressure_tests_results/nodecache_random_files_2.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 50s max duration (incl. graceful stop):
           * default: 50 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 359 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.0s/20s

running (02.0s), 50/50 VUs, 729 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.0s/20s

running (03.0s), 50/50 VUs, 1167 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  03.0s/20s

running (04.0s), 50/50 VUs, 1602 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  04.0s/20s

running (05.0s), 50/50 VUs, 1992 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  05.0s/20s

running (06.0s), 50/50 VUs, 2427 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  06.0s/20s

running (07.0s), 50/50 VUs, 2879 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  07.0s/20s

running (08.0s), 50/50 VUs, 3292 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  08.0s/20s

running (09.0s), 50/50 VUs, 3751 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  09.0s/20s

running (10.0s), 50/50 VUs, 4185 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  10.0s/20s

running (11.0s), 50/50 VUs, 4605 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  11.0s/20s

running (12.0s), 50/50 VUs, 5038 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  12.0s/20s

running (13.0s), 50/50 VUs, 5463 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  13.0s/20s

running (14.0s), 50/50 VUs, 5916 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  14.0s/20s

running (15.0s), 50/50 VUs, 6337 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  15.0s/20s

running (16.0s), 50/50 VUs, 6760 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  16.0s/20s

running (17.0s), 50/50 VUs, 7215 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  17.0s/20s

running (18.0s), 50/50 VUs, 7595 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  18.0s/20s

running (19.0s), 50/50 VUs, 8031 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  19.0s/20s

running (20.0s), 50/50 VUs, 8463 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  20.0s/20s

running (20.1s), 00/50 VUs, 8514 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  20s

     data_received..................: 1.8 GB 90 MB/s
     data_sent......................: 1.1 MB 54 kB/s
     http_req_blocked...............: avg=13.82µs  min=0s       med=1µs      max=9.42ms   p(90)=2µs      p(95)=4µs     
     http_req_connecting............: avg=7.56µs   min=0s       med=0s       max=1.52ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=17.37ms  min=155µs    med=14.17ms  max=142.56ms p(90)=33.61ms  p(95)=42.91ms 
       { expected_response:true }...: avg=17.68ms  min=155µs    med=14.4ms   max=142.56ms p(90)=33.91ms  p(95)=43.27ms 
     http_req_failed................: 11.95% ✓ 1018       ✗ 7496
     http_req_receiving.............: avg=217.32µs min=6µs      med=42µs     max=87.82ms  p(90)=140µs    p(95)=186µs   
     http_req_sending...............: avg=8.44µs   min=2µs      med=4µs      max=8.77ms   p(90)=10µs     p(95)=16µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=17.15ms  min=141µs    med=14.05ms  max=117.33ms p(90)=33.41ms  p(95)=41.89ms 
     http_reqs......................: 8514   423.000874/s
     iteration_duration.............: avg=117.79ms min=100.21ms med=114.49ms max=243.23ms p(90)=133.97ms p(95)=143.55ms
     iterations.....................: 8514   423.000874/s
     vus............................: 50     min=50       max=50
     vus_max........................: 50     min=50       max=50