pressure_tests_results/nodecache_random_files_3.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 50s max duration (incl. graceful stop):
           * default: 50 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 370 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.0s/20s

running (02.0s), 50/50 VUs, 805 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.0s/20s

running (03.0s), 50/50 VUs, 1230 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  03.0s/20s

running (04.0s), 50/50 VUs, 1661 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  04.0s/20s

running (05.0s), 50/50 VUs, 2102 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  05.0s/20s

running (06.0s), 50/50 VUs, 2533 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  06.0s/20s

running (07.0s), 50/50 VUs, 2984 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  07.0s/20s

running (08.0s), 50/50 VUs, 3429 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  08.0s/20s

running (09.0s), 50/50 VUs, 3870 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  09.0s/20s

running (10.0s), 50/50 VUs, 4321 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  10.0s/20s

running (11.0s), 50/50 VUs, 4759 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  11.0s/20s

running (12.0s), 50/50 VUs, 5215 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  12.0s/20s

running (13.0s), 50/50 VUs, 5647 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  13.0s/20s

running (14.0s), 50/50 VUs, 6069 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  14.0s/20s

running (15.0s), 50/50 VUs, 6491 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  15.0s/20s

running (16.0s), 50/50 VUs, 6936 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  16.0s/20s

running (17.0s), 50/50 VUs, 7360 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  17.0s/20s

running (18.0s), 50/50 VUs, 7797 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  18.0s/20s

running (19.0s), 50/50 VUs, 8236 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  19.0s/20s

running (20.0s), 50/50 VUs, 8664 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  20.0s/20s

running (20.1s), 00/50 VUs, 8715 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  20s

     data_received..................: 1.8 GB 90 MB/s
     data_sent......................: 1.1 MB 55 kB/s
     http_req_blocked...............: avg=10.21µs  min=0s       med=1µs      max=2.23ms   p(90)=2µs      p(95)=3µs     
     http_req_connecting............: avg=6.84µs   min=0s       med=0s       max=1.45ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=14.76ms  min=150µs    med=12.69ms  max=86.93ms  p(90)=29.77ms  p(95)=35.51ms 
       { expected_response:true }...: avg=14.99ms  min=150µs    med=12.95ms  max=86.93ms  p(90)=30.1ms   p(95)=35.81ms 
     http_req_failed................: 12.20% ✓ 1064       ✗ 7651
     http_req_receiving.............: avg=170.63µs min=6µs      med=37µs     max=77.56ms  p(90)=131µs    p(95)=166µs   
     http_req_sending...............: avg=7.99µs   min=2µs      med=4µs      max=11.34ms  p(90)=9µs      p(95)=14µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=14.58ms  min=136µs    med=12.59ms  max=80.66ms  p(90)=29.51ms  p(95)=35.2ms  
     http_reqs......................: 8715   433.192324/s
     iteration_duration.............: avg=115.11ms min=100.18ms med=113.04ms max=189.14ms p(90)=130.17ms p(95)=135.85ms
     iterations.....................: 8715   433.192324/s
     vus............................: 50     min=50       max=50
     vus_max........................: 50     min=50       max=50